art_share_api/app/controllers/artwork_shares_controller.rb

  def index
    if params.key?(:user_id)
      viewer = User.find(params[:user_id])
      render json: viewer.artwork_shares
    else
      artwork = Artwork.find(params[:artwork_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def show
    artwork_share = ArtworkShare.find(params[:id])
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def destroy
    artwork_share = ArtworkShare.find(params[:id]).destroy
---
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 6]]
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def update
    artwork_share = ArtworkShare.find(params[:id])
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def favorite
    artwork_share = ArtworkShare.find(params[:id])
    artwork_share.favorite ?
      artwork_share.update(favorite: false) :
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "artwork_shares" SET "favorite" = $1, "updated_at" = $2 WHERE "artwork_shares"."id" = $3  [["favorite", true], ["updated_at", "2020-01-02 20:46:23.589740"], ["id", 11]]