art_share_api/app/controllers/artworks_controller.rb

  def update
    artwork = Artwork.find(params[:id])
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def favorite
    artwork = Artwork.find(params[:id])
    artwork.update(favorite: (artwork.favorite ? false : true))
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "artworks" SET "favorite" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["favorite", true], ["updated_at", "2020-01-02 21:11:13.567514"], ["id", 4]]