art_share_api/app/controllers/comments_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def index
    if params.has_key?(:user_id)
      user = User.find(params[:user_id])
      render json: user.comments
    else
      artwork = Artwork.find(params[:artwork_id])

INSERT INTO "comments" ("user_id", "artwork_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 5], ["artwork_id", 4], ["body", "hmmmmm.....55"], ["created_at", "2020-01-02 16:38:19.841967"], ["updated_at", "2020-01-02 16:38:19.841967"]]
---
  def create
    comment = Comment.new(comment_params)
    if comment.save