art_share_api/app/controllers/likes_controller.rb

SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = $1  [["user_id", 5]]
---
  def index
    likeable = ['user_id', 'artwork_id', 'comment_id' ].find {|el| params.has_key?(el.to_sym) }
    class_name = likeable.split("_").first.capitalize.constantize

    render json: class_name.find(params[likeable.to_sym]).likes

INSERT INTO "likes" ("likeable_type", "likeable_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Artwork"], ["likeable_id", 4], ["user_id", 6], ["created_at", "2020-01-02 19:33:42.068586"], ["updated_at", "2020-01-02 19:33:42.068586"]]
---
  def create
    like = Like.new(like_params)
    if like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
---
  def destroy
    like = Like.find(params[:id])
    like.destroy