art_share_api/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE '%sam%')
SELECT "users".* FROM "users"
---
  def index
    # /users?query=sam
    if params.has_key?(:query)
      render json: User.where("username LIKE ?", "%#{params[:query]}%")
    else
      render json: User.all